app/Models/User.php

SELECT *
FROM `users`
WHERE `email` = ''
AND `password` = 'd41d8cd98f00b204e9800998ecf8427e'
 LIMIT 1
---
    public function getUserForEmailAndPassword($email, $password) :Task|null
    {
        return $this->where(['email' => $email, 'password' => $password])->first();